Итоговый_проект_2/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>230</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>230</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

Итоговый_проект_2/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Итоговый_проект_2/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)  
	//при создании нового контрагента и выборе физ.лица поле КПП на форме скрывается 
	//- событие при изменении типа контрагента на форме
	
	УстановитьВидимостьКПП(Объект.ЮридическоеФизическоеЛицо, ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"), Элементы.КПП.Видимость);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) //при открытии карточки контрагента
	
	//реализуем управление видимостью поля КПП в зависимости от типа контрагента
	//физ лицо - кпп - скрыть
	
	УстановитьВидимостьКПП(Объект.ЮридическоеФизическоеЛицо, ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"), Элементы.КПП.Видимость);
	
	//при чтении формы получить полное наименование из краткого
	//и сверить его с полным наименование на форме 
	//если результат при чтении формы не равен тому, что уже есть на форме,
	//то в невидимом булевском реквизите формы "Полное наименование менялось вручную"
	//указать истину, т.е. это поле менялось вручную 
	
	ПроверкаПолногоНаименования =  СформироватьПолноеНаименование(Объект.Наименование);
	
	Если Врег(ПроверкаПолногоНаименования) = Врег(Объект.ПолноеНаименование) Тогда
		ПолноеНаименованиеМенялосьВручную = Ложь;
	Иначе
		ПолноеНаименованиеМенялосьВручную = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКПП(ТипКонтрагента, ЮрЛицо, КППВидимость)
	Если ТипКонтрагента = ЮрЛицо Тогда
		КППВидимость = Истина;
	Иначе
		КППВидимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	//реализуем функцию корректности ИНН - отказ от записи при неверном ИНН и выводом предупреждения
	//создать общий модуль РаботаСИНН с флажками Клиент, Сервер, Внешнее соедение  и организовать экспортную функцию
	
	ТекстОшибки = "";
	Если Не РаботаСИНН.ИННВерен(Объект.ИНН, Объект.ЮридическоеФизическоеЛицо, ТекстОшибки) Тогда
		Отказ = Истина;        
		Сообщить (ТекстОшибки);
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	//реализуем функцию корректности ИНН - с выводом рядом с полем ввода тектового описания ошибки в виде декорации
	//создать общий модуль РаботаСИНН с флажками Клиент, Сервер, Внешнее соедение  и организовать экспортную функцию
	//Здесь ТекстОшибки - элемент формы. декорация
	ТекстОшибки = "";
	Если РаботаСИНН.ИННВерен(Объект.ИНН, Объект.ЮридическоеФизическоеЛицо,ТекстОшибки) Тогда
		Элементы.ТекстОшибки.Видимость = Ложь;
		Элементы.ИНН.ЦветТекста = Новый Цвет;		
	Иначе   
		Элементы.ТекстОшибки.Видимость = Истина;
		Элементы.ТекстОшибки.Заголовок = ТекстОшибки;
		Элементы.ИНН.ЦветТекста = WebЦвета.КрасноФиолетовый;
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент) 
	
	//реализовать поиск распространённых сокращений организационно-правовых форм в начале строки
	//и заполнение полного наименования по краткому с заменой сокращения ОПФ на её полное наименование
	
	//Не изменять полное наименование, если оно уже было изменено пользователем вручную
	//Чтобы это реализовать, при чтении формы получайте полное наименование из краткого
	
	Если ПолноеНаименованиеМенялосьВручную = Ложь Тогда
		Объект.ПолноеНаименование = СформироватьПолноеНаименование(Объект.Наименование); 
	ИначеЕсли ПолноеНаименованиеМенялосьВручную = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПолноеНаименование(КраткоеНаименование)
	
	//реализовать поиск распространённых сокращений организационно-правовых форм в начале строки
	//и заполнение полного наименования по краткому с заменой сокращения ОПФ на её полное наименование
	
	//создадим соответствия. Где Ключ - сокращение ОПФ. Значение - полное название ОПФ
	АббревиатурыОрганизационноПравовыхФорм = Новый Соответствие;
	АббревиатурыОрганизационноПравовыхФорм.Вставить("ООО", "Общество с Ограниченной Ответственностью");
	АббревиатурыОрганизационноПравовыхФорм.Вставить("ОАО", "Открытое Акционерное Общество");
	АббревиатурыОрганизационноПравовыхФорм.Вставить("ПАО", "Публичное Акционерное Общество");
	АббревиатурыОрганизационноПравовыхФорм.Вставить("НАО", "Непубличное Акцианерное Общество");
	АббревиатурыОрганизационноПравовыхФорм.Вставить("ИП", "Индивидуальный Предприниматель");
	АббревиатурыОрганизационноПравовыхФорм.Вставить("ЗАО", "Закрытое Акционерное Общество"); 
	АббревиатурыОрганизационноПравовыхФорм.Вставить("АО", "Акционерное Общество");
	
	//получим массив слов из Краткого наименования
	МассивСловКраткогоНаименования = СтрРазделить(КраткоеНаименование, " "); 
	
	//пройдемся в цикле по всем словам массива 
	Для К=0 по МассивСловКраткогоНаименования.ВГраница() Цикл
		
		//примем, что слово из массива - ключ дл соотвествия
		КлючДляСоотвествия = Врег(МассивСловКраткогоНаименования[К]);
		
		//получим значение из соотвествия по ключу
		ЗначениеИзСоотвествия = АббревиатурыОрганизационноПравовыхФорм[КлючДляСоотвествия];
		
		Если Не ЗначениеИзСоотвествия = Неопределено Тогда 
			//слово из краткого наименования = значени из соотвествия (полная расшифрова ОПФ)
			МассивСловКраткогоНаименования[К] = ЗначениеИзСоотвествия;
			
			Прервать; //нет смысла дальше искать ОПФ
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПолноеНаименование = СтрСоединить(МассивСловКраткогоНаименования, " ");
	
	Возврат  ПолноеНаименование;
	
	
КонецФункции
